# Реализовать два небольших скрипта:
# итератор, генерирующий целые числа, начиная с указанного;
# итератор, повторяющий элементы некоторого списка, определённого заранее.
# Подсказка: используйте функцию count() и cycle() модуля itertools.
# Обратите внимание, что создаваемый цикл не должен быть бесконечным. Предусмотрите условие его завершения.
# Например, в первом задании выводим целые числа, начиная с 3. При достижении числа 10 — завершаем цикл.
# Вторым пунктом необходимо предусмотреть условие, при котором повторение элементов списка прекратится.

# example to run:
# python main6-1.py 3 10
from itertools import count
from sys import argv

script_name, start, end = argv
start, end = min(int(start), int(end)), max(int(start), int(end))
for i in count(start):
    if i > end:
        break
    else:
        print(i)
