# Создать класс TrafficLight (светофор).
# - определить у него один атрибут color (цвет) и метод running (запуск);
# - атрибут реализовать как приватный;
# - в рамках метода реализовать переключение светофора в режимы: красный, жёлтый, зелёный;
# - продолжительность первого состояния (красный) составляет 7 секунд, второго (жёлтый) — 2 секунды, третьего (зелёный) — на ваше усмотрение;
# - переключение между режимами должно осуществляться только в указанном порядке (красный, жёлтый, зелёный);
# - проверить работу примера, создав экземпляр и вызвав описанный метод.
# Задачу можно усложнить, реализовав проверку порядка режимов. При его нарушении выводить соответствующее сообщение и завершать скрипт.
import time


class TrafficLight:
    colors = ('red', 'yellow', 'green')
    times = (7, 2, 5)

    def __init__(self):
        self.__color = TrafficLight.colors[0]

    def running(self):
        for i in range(0, len(TrafficLight.colors)):
            self.__color = TrafficLight.colors[i]
            print(self.__color)
            time.sleep(TrafficLight.times[i])
        self.__color = TrafficLight.colors[0]


tl = TrafficLight()
tl.running()
